  [
    {
      "bookID": 1,
      "bookTitle": "Harry Potter and the Chamber of Secrets ",
      "author":"J. K. Rowling",
      "PublicationDate": "November 28, 2002",
      "price": 12.95,
      "description": "The second instalment of boy wizard Harry Potter's adventures at Hogwarts School of Witchcraft and Wizardry, based on the novel by JK Rowling. A mysterious elf tells Harry to expect trouble during his second year at Hogwarts, but nothing can prepare him for trees that fight back, flying cars, spiders that talk and deadly warnings written in blood on the walls of the school.",
      "starRating": 4.6,
      "imgUrl": "https://vignette.wikia.nocookie.net/harrypotter/images/c/c0/ALOExwKoxdkdeBvVi7NkaFl5Wa5.jpg/revision/latest?cb=20130803163017"
    },
    {
        "bookID": 2,
        "bookTitle": "Harry Potter and the Prisoner of Azkaban",
        "author":"J. K. Rowling",
        "PublicationDate": "June 190, 2004",
        "price": 14.95,
        "description": "Harry Potter's (Daniel Radcliffe) third year at Hogwarts starts off badly when he learns deranged killer Sirius Black (Gary Oldman) has escaped from Azkaban prison and is bent on murdering the teenage wizard. While Hermione's (Emma Watson) cat torments Ron's (Rupert Grint) sickly rat, causing a rift among the trio, a swarm of nasty Dementors is sent to protect the school from Black. A mysterious new teacher helps Harry learn to defend himself, but what is his secret tie to Sirius Black?",
        "starRating": 4.5,
        "imgUrl": "https://upload.wikimedia.org/wikipedia/en/a/a0/Harry_Potter_and_the_Prisoner_of_Azkaban.jpg"
      },
      
      {
        "bookID": 3,
        "bookTitle": "Geronimo Stilton: The Kingdom of Fantasy",
        "author":"Elisabetta Dami",
        "PublicationDate": "September 15, 2003",
        "price": 12,
        "description": "I knew from the start that it was no ordinary day, but I certainly didn’t expect to find a golden staircase in my attic. Up at the top, there was a door. And beyond the door was a world I never could have imagined – the Kingdom of Fantasy! ",
        "starRating": 3.9,
        "imgUrl": "http://t0.gstatic.com/images?q=tbn:ANd9GcRwMHdBo5Efe48a1T3eQ6mY0LeQbeXSOB99OGRP-yYtHvBcY2oG"
      }
      ,
      {
        "bookID": 4,
        "bookTitle": "Billionaire Boy",
        "author":"David Walliams",
        "PublicationDate": "October 28, 2010",
        "price": 11.95,
        "description": "Billionaire Boy is a children's fiction book published on 28 October 2010 by HarperCollins and written by David Walliams and illustrated by Tony Ross. The story follows Joe Spud who is the richest boy in the country and has everything he could ever want, except a friend",
        "starRating": 4.0,
        "imgUrl": "https://i.harperapps.com/covers/9780007371433/x293.jpg"
      }
      ,
      {
        "bookID": 5,
        "bookTitle": "The Dragon of Fortune",
        "author":"Elisabetta Dami",
        "PublicationDate": "September 12, 2017",
        "price": 11.95,
        "description": "I, Geronimo Stilton, traveled on the wings of the Dragon of Fortune back to the Kingdom of Fantasy! I was called there by my friend Blossom, Queen of the Fairies, who needed my help. The enchanted Winged Ring had gone missing! This was terrible news. The ring allows its owner to travel between the Kingdom of Fantasy and the real world-which would be a dangerous power if it fell into evil hands. Could I find the ring before it was too late?",
        "starRating": 4.4,
        "imgUrl": "https://books.google.com.au/books/content?id=daz8DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE73alt7bdr1Gd1XtlDOgWvU2VkHWkz4dYkByCWN1veys5FREURbBylD3122yigR4SPLJi7N1Acos85kT-F4nj8vmEkqk1MHrS0uVpteWI3GsxChKQt4GU_hlYU3-Pn9fza_BPzja"
      }
      ,
      {
        "bookID": 6,
        "bookTitle": "The Secret Seven",
        "author":"Enid Blyton",
        "PublicationDate": "",
        "price": 7.50,
        "description": "In this, the Secret Seven's first adventure together, Jack's adventure on a snowy night leads them to an old house, a deaf caretaker and a thrilling mystery!",
        "starRating": 3.0,
        "imgUrl": "https://upload.wikimedia.org/wikipedia/en/8/89/TheSecretSeven.jpg"
      }
    ]